public/blog/posts/how I made this website.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-19 Tue 13:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Morgan Kothman</title>
<meta name="author" content="Morgan Kothman">
<meta name="description" content="Morgan is a tech support specialist in Michigan,
focusing on making technology more accessible for the
average person.">
<meta name="keywords" content="Morgan Kothman, tech support, tech support specialist, tech accessibility">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" href="https://kothman.github.io/styles.css?busted=1732042323"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap-icons@1.11.3/font/bootstrap-icons.min.css">
</head>
<body>
<div id="preamble" class="status">
<header><nav><ul><li><a href="https://kothman.github.io"><h1>Morgan Kothman</h1><h3>tech support for the people</h3></a><li id="nav-home"><a href="https://kothman.github.io/">home</a></li><li id="nav-blog"><a href="https://kothman.github.io/blog/">blog</a></li><li id="nav-contact"><a href="mailto:mari.morcant@gmail.com">mari.morcant@gmail.com</a></li></ul></nav></header>
</div>
<div id="content" class="content">
<div id="content-subcontainer" class="content-subcontainer">
<div id="outline-container-orga81b92a" class="outline-1">
<h1 id="orga81b92a">How I made this website <span class="timestamp-wrapper"><span class="timestamp">Monday, November 18, 2024</span></span></h1>
<div class="outline-text-1" id="text-orga81b92a">
</div>
<div id="outline-container-orgcfe2e4d" class="outline-2">
<h2 id="orgcfe2e4d">Welcome to my inaugural blog post!</h2>
<div class="outline-text-2" id="text-orgcfe2e4d">
</div>
<div id="outline-container-org0b6328d" class="outline-6">
<h6 id="org0b6328d">If you're reading this, you've successfully located my website&#x2026;</h6>
<div class="outline-text-6" id="text-org0b6328d">
<p>
Because we live in a world where capitalism rules every moment of our waking
lives, it's advantageous for me to blog about my adventures in programming, so
that anyone with an inclination to interview or hire me might better understand
my dedication to the craft.
</p>

<p>
Here's a blog post about how I made the website you're currently viewing, using
two ancient and obscure tools you've likely never heard of: Emacs and
Org-Mode. If you don't know what these are, don't worry, because that's what
I'll be covering first.
</p>
</div>
</div>
</div>
<div id="outline-container-org5c98548" class="outline-2">
<h2 id="org5c98548">Emacs</h2>
<div class="outline-text-2" id="text-org5c98548">
<p>
What the hell is Emacs, anyway? I know I'm throwing some unfamiliar terminology
at you, but bear with me.
</p>
</div>
</div>
<div id="outline-container-org4fd542e" class="outline-2">
<h2 id="org4fd542e">Org-Mode</h2>
<div class="outline-text-2" id="text-org4fd542e">
<p>
If, for whatever reason, you thought Org-Mode would be some newfangled
technology, think again!
</p>

<p>
Org-Mode, or Organizational Mode, is a mode in Emacs for creating helpful
documents. Each page on this website has its own individual file (ending with a
.org extension).
</p>

<p>
Org-Mode provides an interesting feature for converting these
org files into HTML ones. HTML files simply define the structure of a page,
including all of the information you're viewing, like this text here!
</p>
</div>
</div>
<div id="outline-container-orgf6d89af" class="outline-2">
<h2 id="orgf6d89af">Breaking down the site&#x2026;</h2>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><span><i class="bi bi-heart"></i> made with <a href="https://www.gnu.org/software/emacs/" target="_blank">emacs</a>, <a href="https://orgmode.org/" target="_blank">org-mode</a>, and love <i class="bi bi-heart"></i></span><br><a target="_blank" href="https://validator.w3.org/check?uri=https://kothman.github.io">w3c validation</a></footer>
</div>
</body>
</html>
